---
kind: property
id: P:Autodesk.Revit.DB.Structure.TrussMemberInfo.hostTrussId
source: html/108d4d33-4879-c6a0-7773-f645f88692a5.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberInfo.hostTrussId Property

The host truss' ElementId of the member.

## Syntax (C#)
```csharp
public ElementId hostTrussId { get; set; }
```